Revit 2027 API
BuiltInFailures.ElectricalFailures.CircuitsOverlapAndDeleteSpareSpace Property
 More than one Spare/Space falls onto the same slot. These Spares/Spaces will be deleted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CircuitsOverlapAndDeleteSpareSpace { get; }
Public Shared ReadOnly Property CircuitsOverlapAndDeleteSpareSpace As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CircuitsOverlapAndDeleteSpareSpace {
	FailureDefinitionId^ get ();
}
static member CircuitsOverlapAndDeleteSpareSpace : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace